app/views/welcome/index.html.erb

SELECT "recipes".* FROM "recipes"
---
   <h5>Featured Recipes of This Week</h5>
   <% Recipe.featured.each do |recipe| %>